; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v5)
		(pred_3 ?v3)
		(pred_2 ?v8)
		(pred_1 ?v8)
		(pred_4 ?v3 ?v8)
		(pred_5)
		(pred_6 ?v3))

   (:action op_1
       :parameters  (?v7 ?v2)
       :precondition (and (not-eq ?v7 ?v2) 
                          (pred_2 ?v7) (pred_2 ?v2) (pred_1 ?v7))
       :effect (and  (pred_1 ?v2)
		     (not (pred_1 ?v7))))


   (:action op_2
       :parameters (?v4 ?v6)
       :precondition  (and  (pred_3 ?v4) (pred_2 ?v6)
			    (pred_4 ?v4 ?v6) (pred_1 ?v6) (pred_5))
       :effect (and (pred_6 ?v4)
		    (not (pred_4 ?v4 ?v6)) 
		    (not (pred_5))))

   (:action op_3
       :parameters  (?v4  ?v6)
       :precondition  (and  (pred_3 ?v4) (pred_2 ?v6)
			    (pred_6 ?v4) (pred_1 ?v6))
       :effect (and (pred_4 ?v4 ?v6)
		    (pred_5)
		    (not (pred_6 ?v4)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_02 obj_01 obj_04 obj_06 obj_05 
          obj_07 obj_03 
)
(:init
(pred_2 obj_02)
(pred_2 obj_01)
(pred_2 obj_04)
(pred_2 obj_06)
(pred_2 obj_05)
(pred_3 obj_07)
(pred_3 obj_03)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(pred_5)
(pred_4 obj_07 obj_01)
(pred_4 obj_03 obj_05)
(pred_1 obj_05)
)
(:goal
(and
(pred_4 obj_07 obj_06)
(pred_4 obj_03 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_07 obj_06) (pred_1 obj_02))
    (sometime-before  (pred_4 obj_03 obj_02) (pred_1 obj_01))
  )
)
)

; plan
1. (op_1 obj_05 obj_01)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_01)
   goals met: 0 of 2
2. (op_2 obj_07 obj_01)
   deleted: (pred_4 obj_07 obj_01) (pred_5)
   added: (pred_6 obj_07)
   goals met: 0 of 2
3. (op_1 obj_01 obj_05)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_05)
   goals met: 0 of 2
4. (op_3 obj_07 obj_05)
   deleted: (pred_6 obj_07)
   added: (pred_4 obj_07 obj_05) (pred_5)
   goals met: 0 of 2
5. (op_2 obj_03 obj_05)
   deleted: (pred_4 obj_03 obj_05) (pred_5)
   added: (pred_6 obj_03)
   goals met: 0 of 2
6. (op_1 obj_05 obj_02)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_02)
   goals met: 0 of 2
7. (op_3 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_4 obj_03 obj_02) (pred_5)
   goals met: 1 of 2
8. (op_1 obj_02 obj_05)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_05)
   goals met: 1 of 2
9. (op_2 obj_07 obj_05)
   deleted: (pred_4 obj_07 obj_05) (pred_5)
   added: (pred_6 obj_07)
   goals met: 1 of 2
10. (op_1 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_06)
   goals met: 1 of 2
11. (op_3 obj_07 obj_06)
   deleted: (pred_6 obj_07)
   added: (pred_4 obj_07 obj_06) (pred_5)
   goals met: 2 of 2
